{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "GRU", "config": {"kernel_regularizer": null, "unroll": false, "dropout": 0.0, "bias_regularizer": null, "dtype": "float32", "return_state": false, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "units": 10, "use_bias": true, "name": "gru_10", "implementation": 1, "go_backwards": false, "batch_input_shape": [null, 10, 22], "activation": "tanh", "reset_after": false, "bias_constraint": null, "recurrent_dropout": 0.0, "stateful": false, "trainable": true, "return_sequences": true, "recurrent_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "GRU", "config": {"kernel_regularizer": null, "unroll": false, "dropout": 0.0, "bias_regularizer": null, "return_state": false, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "units": 10, "use_bias": true, "name": "gru_11", "implementation": 1, "go_backwards": false, "activation": "tanh", "reset_after": false, "bias_constraint": null, "recurrent_dropout": 0.0, "stateful": false, "trainable": true, "return_sequences": true, "recurrent_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "GRU", "config": {"kernel_regularizer": null, "unroll": false, "dropout": 0.0, "bias_regularizer": null, "return_state": false, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "units": 10, "use_bias": true, "name": "gru_12", "implementation": 1, "go_backwards": false, "activation": "tanh", "reset_after": false, "bias_constraint": null, "recurrent_dropout": 0.0, "stateful": false, "trainable": true, "return_sequences": false, "recurrent_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"units": 1, "kernel_regularizer": null, "use_bias": true, "name": "dense_5", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "name": "sequential_5"}}